# Bdaav College - Pandas: een data set openen en uitlezen

In [1]:
import pandas as pd

Open de dataset *ufo_sightings.csv* in Excel en bekijk de data. We laden de dataset vervolgens in met *read_csv* en tonen de eerste 5 rijen met *head()*.

In [2]:
ufos = pd.read_csv('ufo_sightings.csv')
ufos.head(5)

,datetime,city,state,country,shape,duration,comments,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,This event took place in early fall around 194...,29.883056,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20.0,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900.0,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

Je kan ook *read_table* gebruiken in plaats van *read_csv*. In dat geval geef je met *sep=''* aan welk scheidingsteken er in het bestand gebruikt wordt:

In [3]:
ufos = pd.read_table('ufo_sightings.csv', sep=',')
ufos.head(5)

,datetime,city,state,country,shape,duration,comments,latitude,longitude
0,10/10/1949 20:30,san marcos,tx,us,cylinder,2700.0,This event took place in early fall around 194...,29.883056,-97.941111
1,10/10/1949 21:00,lackland afb,tx,NaN,light,7200.0,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
2,10/10/1955 17:00,chester (uk/england),NaN,gb,circle,20.0,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
3,10/10/1956 21:00,edna,tx,us,circle,20.0,My older brother and twin sister were leaving ...,28.978333,-96.645833
4,10/10/1960 20:00,kaneohe,hi,us,light,900.0,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

Zoals hierboven te zien is maakt Pandas zelf een index aan (dikgedrukte 0 t/m 4 voor de eerste vijf rijen). Als je één van je kolommen als index wilt gebruiken dan kan je dit bij het openen aangeven. Ook kan je het aangeven wanneer de eerste regel van je dataset geen kolomnamen zijn. Als voorbeeld nemen we het bestand *ufos_zonder_kolomnamen.csv*. Bekijk dit bestand eerst in Excel. Daarna laden we het in, waarbij we aangeven dat het bestand al een index bevat (eerste kolom) en geen kolomnamen (headers).

In [4]:
ufos = pd.read_csv('ufos_zonder_kolomnamen.csv', index_col=0, header=None)
ufos.head(5)

,1,2,3,4,5,6,7,8
0,,,,,,,,
10/10/1949,san marcos,tx,us,cylinder,2700.0,This event took place in early fall around 194...,29.883056,-97.941111
10/10/1949,lackland afb,tx,NaN,light,7200.0,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
10/10/1955,chester (uk/england),NaN,gb,circle,20.0,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
10/10/1956,edna,tx,us,circle,20.0,My older brother and twin sister were leaving ...,28.978333,-96.645833
10/10/1960,kaneohe,hi,us,light,900.0,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

Als je geen kolomnamen in het je bestand hebt staan, kan je ze ook bij het inladen meegeven als lijst via de parameter *names*:

In [5]:
header_lijst = ['Datum', 'Stad', 'Staat', 'Land', 'Vorm', 'Duur', 'Beschrijving', 'Breedtegraad', 'Lengtegraad']
ufos = pd.read_csv('ufos_zonder_kolomnamen.csv', index_col=0, names=header_lijst)
ufos.head(5)

,Stad,Staat,Land,Vorm,Duur,Beschrijving,Breedtegraad,Lengtegraad
Datum,,,,,,,,
10/10/1949,san marcos,tx,us,cylinder,2700.0,This event took place in early fall around 194...,29.883056,-97.941111
10/10/1949,lackland afb,tx,NaN,light,7200.0,1949 Lackland AFB&#44 TX. Lights racing acros...,29.384210,-98.581082
10/10/1955,chester (uk/england),NaN,gb,circle,20.0,Green/Orange circular disc over Chester&#44 En...,53.200000,-2.916667
10/10/1956,edna,tx,us,circle,20.0,My older brother and twin sister were leaving ...,28.978333,-96.645833
10/10/1960,kaneohe,hi,us,light,900.0,AS a Marine 1st Lt. flying an FJ4B fighter/att...,21.418056,-157.803611

We laden het bestand *ufo_sightings.csv* weer in. De variabele *ufos* is van het type *DataFrame*. Dit is een speciaal datatype (of eigenlijk: *data structure*) dat door Pandas is gedefinieerd.

In [6]:
ufos = pd.read_csv('ufo_sightings.csv')
type(ufos)

pandas.core.frame.DataFrame

Als we een kolom uit een dataframe willen hebben kan dat op twee manieren. De eerste manier is als volgt:

In [7]:
ufos['city']

0                  san marcos
1                lackland afb
2        chester (uk/england)
3                        edna
4                     kaneohe
                 ...
80326               nashville
80327                   boise
80328                    napa
80329                  vienna
80330                  edmond
Name: city, Length: 80331, dtype: object

De tweede manier:

In [8]:
ufos.city

0                  san marcos
1                lackland afb
2        chester (uk/england)
3                        edna
4                     kaneohe
                 ...
80326               nashville
80327                   boise
80328                    napa
80329                  vienna
80330                  edmond
Name: city, Length: 80331, dtype: object

Zoals je ziet zorgt Pandas ervoor dat de kolomnamen meteen ook attributen worden. Let wel goed op, want als er bijvoorbeeld spaties in je kolomnamen zitten, werkt dit niet. De eerste manier werkt altijd.

Laten we even kijken van welk variabeltype zo'n kolom is:

In [9]:
type(ufos.city.head(5))

pandas.core.series.Series

Pandas maakt dus onderscheid tussen *DataFrames* (hele tabellen) en *Series* (een enkele kolom).
In de documentatie van Pandas staat het volgende over de data structure 'DataFrame':

> *A DataFrame is a two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). Arithmetic operations align on both row and column labels. Can be thought of as a dict-like container for Series objects.* 

Een Series is dus de data structure van één enkele kolom van een DataFrame. Dit is ook letterlijk zo: de data in een DataFrame wordt in het geheugen opgeslagen als een collectie van Series.